/*******************************************************************************
* Copyright (c) 2013, SHENZHEN SEMITEK Co.,LTD.
* All rights reserved.
*
* 文件名称: flash.h
*
* 功能说明: flash底层驱动头文件
* 修改说明:
1:  版    本: V1.0.0
    修改原因: 初始建立
    修改内容: 初始建立
    修改时间: 2013-01-03
    作    者: 易谦
*******************************************************************************/
#ifndef _FLASH_H_
#define _FLASH_H_

//=============================================================================;
// 配置引用区                                                                  ;
//=============================================================================;

//-----------------------------------------------------------------------------;
// 配置常量定义区
//
#define iDATA_BASE_ADDR         0x0000B000
#define iFLASH_BANK0            0
#define iFLASH_BANK1            1
#define iFLASH_BANK2            2
#define iFLASH_BANK3            3
#define iFLASH_BANK4            4
#define iFLASH_BANK5            5
#define iFLASH_BANK6            6
#define iFLASH_BANK7            7

#define iFLASH_BANK16           16
#define iFLASH_BANK17           17

#define iFLASH_BANK_MAX         24
//
//----------------------------------------------

//=============================================================================;
// 外部定义内部引用区                                                            ;
//=============================================================================;

//-----------------------------------------------------------------------------;
// 外部寄存器引用
//

//-----------------------------------------------------------------------------;
// 外部函数引用
//

//=============================================================================;
// 内部定义外部引用区                                                          ;
//=============================================================================;

//-----------------------------------------------------------------------------;
// 寄存器引用
//
extern bool                 bflash_ctrl;

//-----------------------------------------------------------------------------;
// 函数引用
//
extern bool flash_write(unsigned int addr, unsigned int length);
extern bool flash_write_ble_addr(unsigned int addr);
extern bool flash_read(unsigned int addr, unsigned int length);
extern bool flash_erase(unsigned char bank);

//-----------------------------------------------------------------------------;
#endif

